---
kind: property
id: P:Autodesk.Revit.DB.ExternalResourceMatchOptions.ResourceType
source: html/e43a78d7-06d8-a980-0831-fc0ba321a0b9.htm
---
# Autodesk.Revit.DB.ExternalResourceMatchOptions.ResourceType Property

The desired resource type which external resources should match.

## Syntax (C#)
```csharp
public ExternalResourceType ResourceType { get; }
```